---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FailedToOpenFile
source: html/dc3c9ddd-80c6-ce49-5a02-015a55b0d8de.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FailedToOpenFile Property

Failed to open file.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToOpenFile { get; }
```